[Killed] BlockStatement
src/lib/openrouter.ts:7:76
   code: OpenRouterErrorCode;
   detail?: string;
 
-  constructor(code: OpenRouterErrorCode, message: string, detail?: string) {
-    super(message);
-    this.name = "OpenRouterError";
-    this.code = code;
-    this.detail = detail;
-  }
+  constructor(code: OpenRouterErrorCode, message: string, detail?: string) {}
 }
 
killedBy: POST /api/generations — provider error -> HTTP mapping (R1) maps a provider timeout (AbortError) to 504 ai_timeout
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Survived] StringLiteral
src/lib/openrouter.ts:9:17
 
   constructor(code: OpenRouterErrorCode, message: string, detail?: string) {
     super(message);
-    this.name = "OpenRouterError";
+    this.name = "";
     this.code = code;
     this.detail = detail;

[Survived] StringLiteral
src/lib/openrouter.ts:48:3
 
 const SYSTEM_PROMPT = [
   "You receive a passage of source text. Produce between 3 and 10 question/answer flashcards",
-  "covering its key testable claims. Each card has `front` (a question answerable from the passage)",
+  "",
   "and `back` (the answer — one concept, at most 2 sentences). Write each card in the same language",
   "as the source text. Return only the structured JSON; do not add prose.",

[Survived] StringLiteral
src/lib/openrouter.ts:49:3
 const SYSTEM_PROMPT = [
   "You receive a passage of source text. Produce between 3 and 10 question/answer flashcards",
   "covering its key testable claims. Each card has `front` (a question answerable from the passage)",
-  "and `back` (the answer — one concept, at most 2 sentences). Write each card in the same language",
+  "",
   "as the source text. Return only the structured JSON; do not add prose.",
 ].join(" ");

[Killed] BlockStatement
src/lib/openrouter.ts:58:7
   opts: { apiKey: string; model: string; signal?: AbortSignal },
 ): Promise<CandidateCard[]> {
   let response: Response;
-  try {
-    response = await fetch("https://openrouter.ai/api/v1/chat/completions", {
-      method: "POST",
-      signal: opts.signal,
-      headers: {
-        Authorization: `Bearer ${opts.apiKey}`,
-        "Content-Type": "application/json",
-        "HTTP-Referer": "https://10x-cards.rafsaw.workers.dev",
-        "X-Title": "10xCards",
-      },
-      body: JSON.stringify({
-        model: opts.model,
-        response_format: { type: "json_schema", json_schema: RESPONSE_SCHEMA },
-        messages: [
-          { role: "system", content: SYSTEM_PROMPT },
-          { role: "user", content: sourceText },
-        ],
-      }),
-    });
-  } catch (err) {
+  try {} catch (err) {
     if (err instanceof DOMException && err.name === "AbortError") {
       throw new OpenRouterError("openrouter_timeout", "OpenRouter request timed out.");
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: Cannot read properties of undefined (reading 'ok')

[Survived] ObjectLiteral
src/lib/openrouter.ts:59:77
 ): Promise<CandidateCard[]> {
   let response: Response;
   try {
-    response = await fetch("https://openrouter.ai/api/v1/chat/completions", {
-      method: "POST",
-      signal: opts.signal,
-      headers: {
-        Authorization: `Bearer ${opts.apiKey}`,
-        "Content-Type": "application/json",
-        "HTTP-Referer": "https://10x-cards.rafsaw.workers.dev",
-        "X-Title": "10xCards",
-      },
-      body: JSON.stringify({
-        model: opts.model,
-        response_format: { type: "json_schema", json_schema: RESPONSE_SCHEMA },
-        messages: [
-          { role: "system", content: SYSTEM_PROMPT },
-          { role: "user", content: sourceText },
-        ],
-      }),
-    });
+    response = await fetch("https://openrouter.ai/api/v1/chat/completions", {});
   } catch (err) {
     if (err instanceof DOMException && err.name === "AbortError") {

[Survived] StringLiteral
src/lib/openrouter.ts:60:15
   let response: Response;
   try {
     response = await fetch("https://openrouter.ai/api/v1/chat/completions", {
-      method: "POST",
+      method: "",
       signal: opts.signal,
       headers: {

[Survived] ArrayDeclaration
src/lib/openrouter.ts:71:19
       body: JSON.stringify({
         model: opts.model,
         response_format: { type: "json_schema", json_schema: RESPONSE_SCHEMA },
-        messages: [
-          { role: "system", content: SYSTEM_PROMPT },
-          { role: "user", content: sourceText },
-        ],
+        messages: [],
       }),
     });

[Survived] StringLiteral
src/lib/openrouter.ts:72:19
         model: opts.model,
         response_format: { type: "json_schema", json_schema: RESPONSE_SCHEMA },
         messages: [
-          { role: "system", content: SYSTEM_PROMPT },
+          { role: "", content: SYSTEM_PROMPT },
           { role: "user", content: sourceText },
         ],

[Survived] ObjectLiteral
src/lib/openrouter.ts:72:11
         model: opts.model,
         response_format: { type: "json_schema", json_schema: RESPONSE_SCHEMA },
         messages: [
-          { role: "system", content: SYSTEM_PROMPT },
+          {},
           { role: "user", content: sourceText },
         ],

[Killed] BlockStatement
src/lib/openrouter.ts:77:17
         ],
       }),
     });
-  } catch (err) {
-    if (err instanceof DOMException && err.name === "AbortError") {
-      throw new OpenRouterError("openrouter_timeout", "OpenRouter request timed out.");
-    }
-    throw new OpenRouterError("openrouter_http_error", "Failed to reach OpenRouter.", String(err));
-  }
+  } catch (err) {}
 
   if (!response.ok) {
killedBy: POST /api/generations — provider error -> HTTP mapping (R1) maps a provider timeout (AbortError) to 504 ai_timeout
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
src/lib/openrouter.ts:78:40
       }),
     });
   } catch (err) {
-    if (err instanceof DOMException && err.name === "AbortError") {
+    if (err instanceof DOMException && err.name !== "AbortError") {
       throw new OpenRouterError("openrouter_timeout", "OpenRouter request timed out.");
     }
killedBy: POST /api/generations — provider error -> HTTP mapping (R1) maps a provider timeout (AbortError) to 504 ai_timeout
statusReason: expected 502 to be 504 // Object.is equality

[Killed] BlockStatement
src/lib/openrouter.ts:78:67
       }),
     });
   } catch (err) {
-    if (err instanceof DOMException && err.name === "AbortError") {
-      throw new OpenRouterError("openrouter_timeout", "OpenRouter request timed out.");
-    }
+    if (err instanceof DOMException && err.name === "AbortError") {}
     throw new OpenRouterError("openrouter_http_error", "Failed to reach OpenRouter.", String(err));
   }
killedBy: POST /api/generations — provider error -> HTTP mapping (R1) maps a provider timeout (AbortError) to 504 ai_timeout
statusReason: expected 502 to be 504 // Object.is equality

[Survived] StringLiteral
src/lib/openrouter.ts:79:55
     });
   } catch (err) {
     if (err instanceof DOMException && err.name === "AbortError") {
-      throw new OpenRouterError("openrouter_timeout", "OpenRouter request timed out.");
+      throw new OpenRouterError("openrouter_timeout", "");
     }
     throw new OpenRouterError("openrouter_http_error", "Failed to reach OpenRouter.", String(err));

[Survived] StringLiteral
src/lib/openrouter.ts:81:56
     if (err instanceof DOMException && err.name === "AbortError") {
       throw new OpenRouterError("openrouter_timeout", "OpenRouter request timed out.");
     }
-    throw new OpenRouterError("openrouter_http_error", "Failed to reach OpenRouter.", String(err));
+    throw new OpenRouterError("openrouter_http_error", "", String(err));
   }
 

[Killed] BlockStatement
src/lib/openrouter.ts:84:21
     throw new OpenRouterError("openrouter_http_error", "Failed to reach OpenRouter.", String(err));
   }
 
-  if (!response.ok) {
-    const body = await response.text().catch(() => "");
-    throw new OpenRouterError(
-      "openrouter_http_error",
-      `OpenRouter returned ${response.status}. The configured model may not support JSON-schema responses.`,
-      body.slice(0, 500),
-    );
-  }
+  if (!response.ok) {}
 
   let payload: unknown;
killedBy: POST /api/generations — provider error -> HTTP mapping (R1) maps any other OpenRouterError (non-200 upstream) to 502 ai_provider_error
statusReason: expected 'ai_parse_error' to be 'ai_provider_error' // Object.is equality

[Survived] ArrowFunction
src/lib/openrouter.ts:85:46
   }
 
   if (!response.ok) {
-    const body = await response.text().catch(() => "");
+    const body = await response.text().catch(() => undefined);
     throw new OpenRouterError(
       "openrouter_http_error",

[Survived] StringLiteral
src/lib/openrouter.ts:88:7
     const body = await response.text().catch(() => "");
     throw new OpenRouterError(
       "openrouter_http_error",
-      `OpenRouter returned ${response.status}. The configured model may not support JSON-schema responses.`,
+      ``,
       body.slice(0, 500),
     );

[Killed] MethodExpression
src/lib/openrouter.ts:89:7
     throw new OpenRouterError(
       "openrouter_http_error",
       `OpenRouter returned ${response.status}. The configured model may not support JSON-schema responses.`,
-      body.slice(0, 500),
+      body,
     );
   }
killedBy: generateCandidateCards — typed-error contract maps a non-200 response to openrouter_http_error and truncates detail to 500 chars
statusReason: expected 'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' to have a length of 500 but got 600

[Killed] BlockStatement
src/lib/openrouter.ts:94:7
   }
 
   let payload: unknown;
-  try {
-    payload = await response.json();
-  } catch {
+  try {} catch {
     throw new OpenRouterError("openrouter_parse_error", "OpenRouter response was not valid JSON.");
   }
killedBy: generateCandidateCards — happy path returns 3 trimmed cards from a well-formed 3-card response
statusReason: OpenRouter response had no message content.

[Survived] BlockStatement
src/lib/openrouter.ts:96:11
   let payload: unknown;
   try {
     payload = await response.json();
-  } catch {
-    throw new OpenRouterError("openrouter_parse_error", "OpenRouter response was not valid JSON.");
-  }
+  } catch {}
 
   const content = extractMessageContent(payload);

[Killed] StringLiteral
src/lib/openrouter.ts:97:31
   try {
     payload = await response.json();
   } catch {
-    throw new OpenRouterError("openrouter_parse_error", "OpenRouter response was not valid JSON.");
+    throw new OpenRouterError("", "OpenRouter response was not valid JSON.");
   }
 
killedBy: generateCandidateCards — typed-error contract maps a non-JSON HTTP envelope to openrouter_parse_error
statusReason: expected '' to be 'openrouter_parse_error' // Object.is equality

[Survived] StringLiteral
src/lib/openrouter.ts:97:57
   try {
     payload = await response.json();
   } catch {
-    throw new OpenRouterError("openrouter_parse_error", "OpenRouter response was not valid JSON.");
+    throw new OpenRouterError("openrouter_parse_error", "");
   }
 

[Killed] EqualityOperator
src/lib/openrouter.ts:101:7
   }
 
   const content = extractMessageContent(payload);
-  if (content === null) {
+  if (content !== null) {
     throw new OpenRouterError("openrouter_parse_error", "OpenRouter response had no message content.");
   }
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/openrouter.ts:101:7
   }
 
   const content = extractMessageContent(payload);
-  if (content === null) {
+  if (true) {
     throw new OpenRouterError("openrouter_parse_error", "OpenRouter response had no message content.");
   }
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] BlockStatement
src/lib/openrouter.ts:106:7
   }
 
   let parsed: unknown;
-  try {
-    parsed = JSON.parse(content);
-  } catch {
+  try {} catch {
     throw new OpenRouterError("openrouter_parse_error", "Model output was not valid JSON.");
   }
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Survived] BlockStatement
src/lib/openrouter.ts:108:11
   let parsed: unknown;
   try {
     parsed = JSON.parse(content);
-  } catch {
-    throw new OpenRouterError("openrouter_parse_error", "Model output was not valid JSON.");
-  }
+  } catch {}
 
   const cards = extractCards(parsed);

[Survived] StringLiteral
src/lib/openrouter.ts:109:57
   try {
     parsed = JSON.parse(content);
   } catch {
-    throw new OpenRouterError("openrouter_parse_error", "Model output was not valid JSON.");
+    throw new OpenRouterError("openrouter_parse_error", "");
   }
 

[Killed] ConditionalExpression
src/lib/openrouter.ts:113:7
   }
 
   const cards = extractCards(parsed);
-  if (cards.length === 0) {
+  if (true) {
     throw new OpenRouterError("openrouter_parse_error", "Model returned no usable cards.");
   }
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] EqualityOperator
src/lib/openrouter.ts:113:7
   }
 
   const cards = extractCards(parsed);
-  if (cards.length === 0) {
+  if (cards.length !== 0) {
     throw new OpenRouterError("openrouter_parse_error", "Model returned no usable cards.");
   }
killedBy: generateCandidateCards — typed-error contract maps an empty card list to openrouter_parse_error
statusReason: expected generateCandidateCards to reject, but it resolved

[Survived] StringLiteral
src/lib/openrouter.ts:114:57
 
   const cards = extractCards(parsed);
   if (cards.length === 0) {
-    throw new OpenRouterError("openrouter_parse_error", "Model returned no usable cards.");
+    throw new OpenRouterError("openrouter_parse_error", "");
   }
 

[Killed] MethodExpression
src/lib/openrouter.ts:117:10
     throw new OpenRouterError("openrouter_parse_error", "Model returned no usable cards.");
   }
 
-  return cards.slice(0, 10);
+  return cards;
 }
 
killedBy: generateCandidateCards — happy path slices a response of more than 10 cards down to 10
statusReason: expected [ { front: 'Q0', back: 'A0' }, …(11) ] to have a length of 10 but got 12

[Killed] BlockStatement
src/lib/openrouter.ts:120:65
   return cards.slice(0, 10);
 }
 
-function extractMessageContent(payload: unknown): string | null {
-  if (typeof payload !== "object" || payload === null) return null;
-  const choices = (payload as { choices?: unknown }).choices;
-  if (!Array.isArray(choices) || choices.length === 0) return null;
-  const message = (choices[0] as { message?: unknown }).message;
-  if (typeof message !== "object" || message === null) return null;
-  const content = (message as { content?: unknown }).content;
-  return typeof content === "string" ? content : null;
-}
+function extractMessageContent(payload: unknown): string | null {}
 
 function extractCards(parsed: unknown): CandidateCard[] {
killedBy: generateCandidateCards — happy path returns 3 trimmed cards from a well-formed 3-card response
statusReason: Model output was not valid JSON.

[Killed] EqualityOperator
src/lib/openrouter.ts:121:7
 }
 
 function extractMessageContent(payload: unknown): string | null {
-  if (typeof payload !== "object" || payload === null) return null;
+  if (typeof payload === "object" || payload === null) return null;
   const choices = (payload as { choices?: unknown }).choices;
   if (!Array.isArray(choices) || choices.length === 0) return null;
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] EqualityOperator
src/lib/openrouter.ts:121:38
 }
 
 function extractMessageContent(payload: unknown): string | null {
-  if (typeof payload !== "object" || payload === null) return null;
+  if (typeof payload !== "object" || payload !== null) return null;
   const choices = (payload as { choices?: unknown }).choices;
   if (!Array.isArray(choices) || choices.length === 0) return null;
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/lib/openrouter.ts:123:7
 function extractMessageContent(payload: unknown): string | null {
   if (typeof payload !== "object" || payload === null) return null;
   const choices = (payload as { choices?: unknown }).choices;
-  if (!Array.isArray(choices) || choices.length === 0) return null;
+  if (Array.isArray(choices) || choices.length === 0) return null;
   const message = (choices[0] as { message?: unknown }).message;
   if (typeof message !== "object" || message === null) return null;
killedBy: generateCandidateCards — happy path returns 3 trimmed cards from a well-formed 3-card response
statusReason: OpenRouter response had no message content.

[Killed] ConditionalExpression
src/lib/openrouter.ts:123:7
 function extractMessageContent(payload: unknown): string | null {
   if (typeof payload !== "object" || payload === null) return null;
   const choices = (payload as { choices?: unknown }).choices;
-  if (!Array.isArray(choices) || choices.length === 0) return null;
+  if (false) return null;
   const message = (choices[0] as { message?: unknown }).message;
   if (typeof message !== "object" || message === null) return null;
killedBy: generateCandidateCards — typed-error contract maps an empty choices array to openrouter_parse_error
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of OpenRouterError

[Killed] EqualityOperator
src/lib/openrouter.ts:125:38
   const choices = (payload as { choices?: unknown }).choices;
   if (!Array.isArray(choices) || choices.length === 0) return null;
   const message = (choices[0] as { message?: unknown }).message;
-  if (typeof message !== "object" || message === null) return null;
+  if (typeof message !== "object" || message !== null) return null;
   const content = (message as { content?: unknown }).content;
   return typeof content === "string" ? content : null;
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] EqualityOperator
src/lib/openrouter.ts:125:7
   const choices = (payload as { choices?: unknown }).choices;
   if (!Array.isArray(choices) || choices.length === 0) return null;
   const message = (choices[0] as { message?: unknown }).message;
-  if (typeof message !== "object" || message === null) return null;
+  if (typeof message === "object" || message === null) return null;
   const content = (message as { content?: unknown }).content;
   return typeof content === "string" ? content : null;
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/openrouter.ts:127:10
   const message = (choices[0] as { message?: unknown }).message;
   if (typeof message !== "object" || message === null) return null;
   const content = (message as { content?: unknown }).content;
-  return typeof content === "string" ? content : null;
+  return false ? content : null;
 }
 
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] EqualityOperator
src/lib/openrouter.ts:127:10
   const message = (choices[0] as { message?: unknown }).message;
   if (typeof message !== "object" || message === null) return null;
   const content = (message as { content?: unknown }).content;
-  return typeof content === "string" ? content : null;
+  return typeof content !== "string" ? content : null;
 }
 
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] BlockStatement
src/lib/openrouter.ts:130:57
   return typeof content === "string" ? content : null;
 }
 
-function extractCards(parsed: unknown): CandidateCard[] {
-  if (typeof parsed !== "object" || parsed === null) return [];
-  const cards = (parsed as { cards?: unknown }).cards;
-  if (!Array.isArray(cards)) return [];
-  return cards.flatMap((item) => {
-    if (typeof item !== "object" || item === null) return [];
-    const front = (item as { front?: unknown }).front;
-    const back = (item as { back?: unknown }).back;
-    if (typeof front !== "string" || typeof back !== "string") return [];
-    const trimmedFront = front.trim();
-    const trimmedBack = back.trim();
-    if (trimmedFront.length === 0 || trimmedBack.length === 0) return [];
-    return [{ front: trimmedFront, back: trimmedBack }];
-  });
-}
+function extractCards(parsed: unknown): CandidateCard[] {}
 
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/lib/openrouter.ts:131:7
 }
 
 function extractCards(parsed: unknown): CandidateCard[] {
-  if (typeof parsed !== "object" || parsed === null) return [];
+  if (typeof parsed === "object" || parsed === null) return [];
   const cards = (parsed as { cards?: unknown }).cards;
   if (!Array.isArray(cards)) return [];
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] EqualityOperator
src/lib/openrouter.ts:131:37
 }
 
 function extractCards(parsed: unknown): CandidateCard[] {
-  if (typeof parsed !== "object" || parsed === null) return [];
+  if (typeof parsed !== "object" || parsed !== null) return [];
   const cards = (parsed as { cards?: unknown }).cards;
   if (!Array.isArray(cards)) return [];
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/openrouter.ts:133:7
 function extractCards(parsed: unknown): CandidateCard[] {
   if (typeof parsed !== "object" || parsed === null) return [];
   const cards = (parsed as { cards?: unknown }).cards;
-  if (!Array.isArray(cards)) return [];
+  if (true) return [];
   return cards.flatMap((item) => {
     if (typeof item !== "object" || item === null) return [];
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/lib/openrouter.ts:133:7
 function extractCards(parsed: unknown): CandidateCard[] {
   if (typeof parsed !== "object" || parsed === null) return [];
   const cards = (parsed as { cards?: unknown }).cards;
-  if (!Array.isArray(cards)) return [];
+  if (Array.isArray(cards)) return [];
   return cards.flatMap((item) => {
     if (typeof item !== "object" || item === null) return [];
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] BlockStatement
src/lib/openrouter.ts:134:34
   if (typeof parsed !== "object" || parsed === null) return [];
   const cards = (parsed as { cards?: unknown }).cards;
   if (!Array.isArray(cards)) return [];
-  return cards.flatMap((item) => {
-    if (typeof item !== "object" || item === null) return [];
-    const front = (item as { front?: unknown }).front;
-    const back = (item as { back?: unknown }).back;
-    if (typeof front !== "string" || typeof back !== "string") return [];
-    const trimmedFront = front.trim();
-    const trimmedBack = back.trim();
-    if (trimmedFront.length === 0 || trimmedBack.length === 0) return [];
-    return [{ front: trimmedFront, back: trimmedBack }];
-  });
+  return cards.flatMap((item) => {});
 }
 
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: Cannot read properties of undefined (reading 'front')

[Killed] EqualityOperator
src/lib/openrouter.ts:135:9
   const cards = (parsed as { cards?: unknown }).cards;
   if (!Array.isArray(cards)) return [];
   return cards.flatMap((item) => {
-    if (typeof item !== "object" || item === null) return [];
+    if (typeof item === "object" || item === null) return [];
     const front = (item as { front?: unknown }).front;
     const back = (item as { back?: unknown }).back;
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/openrouter.ts:135:9
   const cards = (parsed as { cards?: unknown }).cards;
   if (!Array.isArray(cards)) return [];
   return cards.flatMap((item) => {
-    if (typeof item !== "object" || item === null) return [];
+    if (true) return [];
     const front = (item as { front?: unknown }).front;
     const back = (item as { back?: unknown }).back;
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/openrouter.ts:138:9
     if (typeof item !== "object" || item === null) return [];
     const front = (item as { front?: unknown }).front;
     const back = (item as { back?: unknown }).back;
-    if (typeof front !== "string" || typeof back !== "string") return [];
+    if (false) return [];
     const trimmedFront = front.trim();
     const trimmedBack = back.trim();
killedBy: generateCandidateCards — typed-error contract maps an all-invalid card list to openrouter_parse_error
statusReason: expected TypeError: front.trim is not a function to be an instance of OpenRouterError

[Killed] ConditionalExpression
src/lib/openrouter.ts:138:9
     if (typeof item !== "object" || item === null) return [];
     const front = (item as { front?: unknown }).front;
     const back = (item as { back?: unknown }).back;
-    if (typeof front !== "string" || typeof back !== "string") return [];
+    if (false || typeof back !== "string") return [];
     const trimmedFront = front.trim();
     const trimmedBack = back.trim();
killedBy: generateCandidateCards — typed-error contract maps an all-invalid card list to openrouter_parse_error
statusReason: expected TypeError: front.trim is not a function to be an instance of OpenRouterError

[Killed] MethodExpression
src/lib/openrouter.ts:139:26
     const front = (item as { front?: unknown }).front;
     const back = (item as { back?: unknown }).back;
     if (typeof front !== "string" || typeof back !== "string") return [];
-    const trimmedFront = front.trim();
+    const trimmedFront = front;
     const trimmedBack = back.trim();
     if (trimmedFront.length === 0 || trimmedBack.length === 0) return [];
killedBy: POST /api/generations — R5 server authority over the insert payload writes the trimmed candidate front/back from the provider, not raw values
statusReason: expected '  Q1  ' to be 'Q1' // Object.is equality

[Killed] MethodExpression
src/lib/openrouter.ts:140:25
     const back = (item as { back?: unknown }).back;
     if (typeof front !== "string" || typeof back !== "string") return [];
     const trimmedFront = front.trim();
-    const trimmedBack = back.trim();
+    const trimmedBack = back;
     if (trimmedFront.length === 0 || trimmedBack.length === 0) return [];
     return [{ front: trimmedFront, back: trimmedBack }];
killedBy: POST /api/generations — R5 server authority over the insert payload writes the trimmed candidate front/back from the provider, not raw values
statusReason: expected '\n A1 \t' to be 'A1' // Object.is equality

[Killed] LogicalOperator
src/lib/openrouter.ts:141:9
     if (typeof front !== "string" || typeof back !== "string") return [];
     const trimmedFront = front.trim();
     const trimmedBack = back.trim();
-    if (trimmedFront.length === 0 || trimmedBack.length === 0) return [];
+    if (trimmedFront.length === 0 && trimmedBack.length === 0) return [];
     return [{ front: trimmedFront, back: trimmedBack }];
   });
killedBy: extractCards characterisation — pins CURRENT behavior (no floor, silent drop, trim) silently drops malformed items and returns only the valid ones
statusReason: expected [ …(3) ] to have a length of 2 but got 3
