[Killed] EqualityOperator
src/lib/openrouter.ts:141:38
     if (typeof front !== "string" || typeof back !== "string") return [];
     const trimmedFront = front.trim();
     const trimmedBack = back.trim();
-    if (trimmedFront.length === 0 || trimmedBack.length === 0) return [];
+    if (trimmedFront.length === 0 || trimmedBack.length !== 0) return [];
     return [{ front: trimmedFront, back: trimmedBack }];
   });
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] ArrayDeclaration
src/lib/openrouter.ts:142:12
     const trimmedFront = front.trim();
     const trimmedBack = back.trim();
     if (trimmedFront.length === 0 || trimmedBack.length === 0) return [];
-    return [{ front: trimmedFront, back: trimmedBack }];
+    return [];
   });
 }
killedBy: POST /api/generations — request body and source validation accepts a source that is >8000 untrimmed but <=8000 after trim (trim authority)
statusReason: expected 502 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/lib/openrouter.ts:142:13
     const trimmedFront = front.trim();
     const trimmedBack = back.trim();
     if (trimmedFront.length === 0 || trimmedBack.length === 0) return [];
-    return [{ front: trimmedFront, back: trimmedBack }];
+    return [{}];
   });
 }
killedBy: POST /api/generations — R5 server authority over the insert payload writes the trimmed candidate front/back from the provider, not raw values
statusReason: expected undefined to be 'Q1' // Object.is equality
